---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrStairsCutOffset
source: html/ee282392-cab1-43b3-cad0-963b16a72d51.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrStairsCutOffset Property

"Extend Below Base"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrStairsCutOffset { get; }
```